
## Terraform plan for environment: `dev`

**Commit:** 59ed624ae0f7ed946e4e5126954f1914e232dc14


**API version:** c5ba4e9
**CLI version:** da12d1b
**Selfserve version:** c5ba4e9
**Internal version:** c5ba4e9

### Plan summary

`1 to add, 2 to change, 0 to destroy`

**🆕 Creates**

```tf
module.service.aws_cloudfront_function.rewrite_uri
```
**🔄 Updates**

```tf
module.service.module.batch.aws_batch_job_queue.this["default"]
module.service.module.cloudfront.aws_cloudfront_distribution.this[0]
```


----

<details data-gh-workflow="dev-environment-plan"><summary>Show full plan</summary>

```tf


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.service.module.cloudfront.aws_cloudfront_distribution.this[0] has changed
  ~ resource "aws_cloudfront_distribution" "this" {
      ~ etag                            = "EKGIRPR4VTMEW" -> "E10YN3HBUUK4ML"
        id                              = "E3R9S2AKJG4ZTR"
      ~ last_modified_time              = "2024-08-01 09:05:23.564 +0000 UTC" -> "2024-08-01 10:53:57.961 +0000 UTC"
        tags                            = {}
        # (20 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.service.aws_cloudfront_function.rewrite_uri will be created
  + resource "aws_cloudfront_function" "rewrite_uri" {
      + arn             = (known after apply)
      + code            = <<-EOT
            function handler(event) {
              var request = event.request;
              request.uri = request.uri.replace(/^\/static\/public\/assets\//, "/");
              return request;
            }
        EOT
      + etag            = (known after apply)
      + id              = (known after apply)
      + live_stage_etag = (known after apply)
      + name            = "dev-legacy-assets-rewrite-uri"
      + publish         = true
      + runtime         = "cloudfront-js-2.0"
      + status          = (known after apply)
    }

  # module.service.module.batch.aws_batch_job_queue.this["default"] will be updated in-place
  ~ resource "aws_batch_job_queue" "this" {
        id                    = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
        name                  = "vol-app-dev-default"
      + tags                  = {}
        # (6 unchanged attributes hidden)
    }

  # module.service.module.cloudfront.aws_cloudfront_distribution.this[0] will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
        id                              = "E3R9S2AKJG4ZTR"
        tags                            = {}
        # (22 unchanged attributes hidden)

      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          + lambda_function_association {
              + event_type   = "viewer-request"
              + include_body = true
              + lambda_arn   = (known after apply)
            }
        }

        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

```

</details>